{
  "backend/main.mo": "Actor implementing access‑controlled user profiles and per‑user text backups.",
  "feature_evidence.json": "Feature-to-file mapping report listing implemented features and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend source files.",
  "frontend/index.css": "Tailwind base layers plus light/dark CSS variable themes for the app.",
  "frontend/index.html": "Main HTML entry with app root, manifest, icons, and main TSX loader.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme colors, start URL, and icons.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, theme provider, and root app component.",
  "frontend/src/components/AppHeader.tsx": "Header showing app name, online status, navigation trigger, and login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with state handling and query cache clearing.",
  "frontend/src/components/cloud/CloudBackupPanel.tsx": "UI panel enabling upload and download of backups to cloud using actor identity with status handling.",
  "frontend/src/components/common/ErrorBanner.tsx": "Simple destructive alert component displaying an error title and message.",
  "frontend/src/components/customers/CustomerForm.tsx": "Form for creating or editing a customer with validation, error handling, and submit/cancel actions.",
  "frontend/src/components/customers/CustomerInvoicesPanel.tsx": "Displays a customer's invoices with creation via sheet modal and status‑colored invoice list.",
  "frontend/src/components/customers/CustomerSearchBar.tsx": "Search input component for filtering customers by name.",
  "frontend/src/components/invoices/ImagePreviewGallery.tsx": "Shows preview thumbnails of selected images with zoom and remove options plus a full‑screen dialog.",
  "frontend/src/components/invoices/InvoiceFinalizeStep.tsx": "Final review step summarizing invoice data and confirming save with back and submit controls.",
  "frontend/src/components/invoices/InvoiceForm.tsx": "Form to create or edit an invoice with validation, image attachments, and a finalize step before saving.",
  "frontend/src/components/MobileNav.tsx": "Bottom mobile navigation bar linking to customers, backup, and settings.",
  "frontend/src/components/OnlineStatusIndicator.tsx": "Small component showing online/offline status with icons.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to Internet Identity, auto‑refreshing queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state, creating AuthClient instances, and exposing identity, login, and logout helpers.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom hook that tracks and returns the browser’s online/offline status.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for loading and saving the current user's profile using an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and styling for light and dark themes.",
  "frontend/src/lib/backup/backupFormat.ts": "Defines the backup payload structure and provides functions to create and validate backup data.",
  "frontend/src/lib/backup/exportBackup.ts": "Exports all offline data as a JSON backup file for download.",
  "frontend/src/lib/backup/importBackup.ts": "Imports and validates a backup file, restoring customers, invoices, and images.",
  "frontend/src/lib/cloudSync/cloudSync.ts": "Uploads and downloads backup data to and from a cloud actor, validating and restoring it.",
  "frontend/src/lib/downloads/downloadUtils.ts": "Utility functions for downloading blobs or text files via the browser.",
  "frontend/src/lib/downloads/invoiceImageBundle.ts": "Bundles invoice images into a JSON file by converting blobs to base64 and triggers download.",
  "frontend/src/lib/offline/db.ts": "IndexedDB wrapper implementing CRUD helpers for customers, invoices, images, and settings.",
  "frontend/src/lib/offline/models.ts": "Defines TypeScript interfaces for offline customer, invoice, line item, and image data models.",
  "frontend/src/lib/offline/repository.ts": "Implements offline CRUD operations for customers, invoices, images, and exporting/importing all data.",
  "frontend/src/lib/settings/appSettings.ts": "Manages app settings in localStorage, including retrieving and updating the app name.",
  "frontend/src/lib/validation/validators.ts": "Provides simple validation functions for customer names, invoice numbers, and invoice totals.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/BackupRestorePage.tsx": "Provides UI for exporting and importing local backups and managing cloud backups with confirmation dialogs.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Displays and manages a single customer’s details, allowing edits, deletion, and viewing related invoices.",
  "frontend/src/pages/CustomersListPage.tsx": "Lists all customers with search and supports creating new customers via a sheet form.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Shows invoice details, associated customer info, and supports downloading individual or bundled invoice images.",
  "frontend/src/pages/SettingsPage.tsx": "Allows editing app settings and managing user profile information, including initial profile setup.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters (including hash-based routes) and persisting them in sessionStorage, plus utilities for clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing an offline‑first customer and invoice app, including features, requirements, backup expectations, and image assets needed."
}